//===================================================================
// 二つ変数を加算し、別の変数に格納する,C/C++で書いたもの。
//
//
// Linuxの例:
// $ gcc main.cpp
// $ ./a.out
// 1.100000 + 2.200000 = 3.300000
//
// (c)Copyright Spacesoft corp., 2012 All rights reserved.
//                               Hiro KITAYAMA
//===================================================================
#include <stdio.h>

//-------------------------------------------------------------------
// add
static void
add( float *A, float *B, float *C)
{
    *C=*A+*B;
}

//-------------------------------------------------------------------
// main
int
main()
{
    float A=1.1f, B=2.2f, C;

    add(&A, &B, &C);                            //C=A+B;

    printf("%f + %f = %f\n", A, B, C);

    return 0;
}
